In [116]:
from sqlalchemy import create_engine
import pandas as pd

# Define connection parameters
user = "root"
password = "root"
host = "localhost"
port = "3306"
database = "phonepe"

# Create SQLAlchemy engine
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}")

# Connect to the database
conn = engine.connect()

# Case Study 1: Customer Segmentation - Transaction Type Vs transaction_count
query1 = """
SELECT     Transaction_type,
    ROUND(SUM(Transaction_count) / 10000000, 5) AS Total_count_Crore
FROM 
    aggregated_trans
GROUP BY 
    Transaction_type
ORDER BY 
    Total_count_Crore DESC;
    """
# Execute query and load into DataFrame
df1 = pd.read_sql(query1, conn)
df1['query'] = 'query1'

In [117]:
df1

           Transaction_type  Total_count_Crore   query
0         Merchant payments         13023.8755  query1
1     Peer-to-peer payments          8503.2447  query1
2  Recharge & bill payments          1959.6756  query1
3                    Others            26.2050  query1
4        Financial Services            15.4209  query1

In [129]:
### Case Study 2: Customer Segmentation - Transaction_Amount Vs Year

query2 = """
SELECT 
    Year, 
    ROUND(SUM(Transaction_amount) / 1000000000000, 2) AS Total_amount_Trillion
FROM 
    aggregated_trans
GROUP BY 
    Year
ORDER BY 
    SUM(Transaction_amount) DESC;
"""
# Execute query and load into DataFrame
df2 = pd.read_sql(query2, conn)
df2['query'] = 'query2'

In [130]:
df2

   Year  Total_amount_Trillion   query
0  2024                 129.62  query2
1  2023                  94.49  query2
2  2022                  64.27  query2
3  2021                  34.60  query2
4  2020                  14.64  query2
5  2019                   6.28  query2
6  2018                   1.62  query2

In [131]:
from numpy import concat

# Step 3: Combine all results into one CSV
combined_df = pd.concat([df1, df2], ignore_index=True)
combined_df.fillna('', inplace=True)
combined_df.to_csv("case1_combined.csv", index=False)


print("case1_combined.csv created successfully!")

case1_combined.csv created successfully!

C:\Users\Adhiran\AppData\Local\Temp\ipykernel_21260\3314535907.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  combined_df.fillna('', inplace=True)

In [132]:
combined_df

,Transaction_type,Total_count_Crore,query,Year,Total_amount_Trillion
0,Merchant payments,13023.8755,query1,,
1,Peer-to-peer payments,8503.2447,query1,,
2,Recharge & bill payments,1959.6756,query1,,
3,Others,26.205,query1,,
4,Financial Services,15.4209,query1,,
5,,,query2,2024,129.62
6,,,query2,2023,94.49
7,,,query2,2022,64.27
8,,,query2,2021,34.6
9,,,query2,2020,14.64
10,,,query2,2019,6.28
11,,,query2,2018,1.62